//
//  word_list.swift
//  khmer_dictionary
//
//  Created by Pang Phanna on 29/1/23.
//

import Foundation

let wordList: [Word] = [
    Word(
        id: 1,
        word: "ក",
        definition: "ព្យញ្ជនៈទី ១ ក្នុងវគ្គទី ១ ជាកណ្ឋជៈ មានសំឡេងក្នុងឋានបំពង់ក ជាសិថិល-អឃោសៈ, សំ. បា. មានសូរស័ព្ទ​ថា កៈ ។ \n(ន.) អវយវៈដែលតពីក្បាលទៅស្មា ឬទៅខ្លួននៃមនុស្សសត្វ ។ ដៃជើងមនុស្សក៏មាន កដែរ: កដៃ, កជើង ។ ទងខាងដើមកួរស្រូវ​ក៏ហៅ ក ដែរ : កស្រូវ ។ កន្លែងដែលតជាប់ពីមាត់ដបជាដើម​ចុះទៅទល់នឹងក្អេងក៏ហៅ ក ដែរ : កដប, កក្អម ។ \n(កិ.) តាំងផ្ដើម, តាំងធ្វើ : កសាង, កកើត, កចេតិយ, កភូមិ ។"
    ),
    Word(
        id: 2,
        word: "ក៏",
        definition: "(និ.) ពាក្យជាសន្ធានមានសំឡេងកញ្ឆក់ខ្លីសម្រាប់និយាយតប្រយោគដោយឡែក : អ្នកក៏ទៅ, ខ្ញុំក៏ទៅ, ធ្វើដូច្នេះក៏បាន, របស់នេះរូបក៏ល្អ  តម្លៃក៏ថោក ។"
    ),
    Word(
        id: 3,
        word: "កក",
        definition: "(កិ.) ប្រែពីរាវទៅជាខន់ : ខ្លាញ់កក, ប្រេងដូងកក, ទឹកកក ។ \n(គុ. ឬ កិ.វិ.) កុះករ, តាន់តាប់, ជុំជិត, កុញ, ត្រៀបត្រា : មើលទៅឃើញមនុស្សកក, ឈរកក ។"
    ),
    Word(
        id: 4,
        word: "កក់",
        definition: "(កិ.) ជម្រះសក់ឲ្យ​ស្អាត : កក់សក់ ។ ធ្វើឲ្យ​ទទឹកជោក : ភ្លៀងកក់ ។ បញ្ចាំទុកមុន, ឲ្យ​មុនជាការបញ្ចាំចិត្ត : ខ្ញុំបានកក់ប្រាក់៥០​រៀលឲ្យ​គេរួចហើយ ។ \n(ន.) ឈ្មោះស្មៅទឹកមួយពួក សម្រាប់ប្រើជារបរធ្វើកន្ទេល ។ កក់មានច្រើនប្រភេទ គឺ កក់មូល, កក់ជ្រុង, កក់ចែងម៉ែង ។ល។ ឈ្មោះប្រដាប់មួយយ៉ាងមានសណ្ឋានដូចផ្លែឈូកសម្រាប់ងូតទឹក: ទឹកធ្លាក់ចេញពីកក់ (ហៅផ្លែឈូក ក៏បាន)  ។"
    ),
    Word(
        id: 5,
        word: "កក្កដ",
        definition: "បា.; សំ.(ន.)  (កក៌ដ) ក្ដាម ។ ឈ្មោះខែទី ៤ នៃសុរិយគតិ, មាន ៣១ ថ្ងៃ, ត្រូវគ្នានឹងខែ ស៊ូយេត (ខែទី ៧) បារាំងសែស ។ សព្វថ្ងៃប្រើជា កក្កដា ក៏រាប់ជាខែ ទី ៧ ដែរ ។"
    ),
    Word(
        id: 6,
        word: "កករ",
        definition: "(ន.) ផង់ឬកម្ទេចល្អិត ដែលនៅក្នុងសភាវៈរាវ មានទឹក, សុរា, ប្រេងជាដើម : កករប្រេង ។ កករចិត្ត ចិត្តសៅហ្មងហាក់ដូចជាមានកករ ។ ប្រើដូចជា គុ. ក៏បាន : ចិត្តកករល្អក់ ។"
    ),
    Word(
        id: 7,
        word: "កកាត",
        definition: "(គុ.) ដែលនៅសល់តិច, នៅសល់លាបៗ : ទឹកសម្លនៅសល់កកាតនឹងបាតឆ្នាំង ។"
    ),
    Word(
        id: 8,
        word: "កកាយ",
        definition: "(កិ.) កាយរឿយៗ; ជីកដីជារន្ធ, ជារូង, ជារង, ជារណ្ដៅដោយដៃ (មនុស្ស) , ដោយជើង (សត្វ)  : មនុស្សកកាយដី, មាន់កកាយដី, អណ្ដើកកកាយដី ។"
    ),
    Word(
        id: 9,
        word: "កកិចកកុច",
        definition: "(គុ.) ដែលមានចិត្តវៀច, មានគំនិតគេចកែ : មនុស្សកកិចកកុច ។"
    ),
    Word(
        id: 10,
        word: "កកិត",
        definition: "(កិ.) ពាល់, ដដុស, ឬប៉ះយ៉ាងស្រាល ។"
    ),
]
